cmsis-svd/cmsis-svd/data/HDSC/HC32L156KX.svd
                <register>
                    <name>BUR02</name>
                    <description>desc BUR02</description>
                    <addressOffset>0x701</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR03</name>
                    <description>desc BUR03</description>
                    <addressOffset>0x702</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR04</name>
                    <description>desc BUR04</description>
                    <addressOffset>0x703</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR05</name>
                    <description>desc BUR05</description>
                    <addressOffset>0x704</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR06</name>
                    <description>desc BUR06</description>
                    <addressOffset>0x705</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR07</name>
                    <description>desc BUR07</description>
                    <addressOffset>0x706</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR08</name>
                    <description>desc BUR08</description>
                    <addressOffset>0x707</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR09</name>
                    <description>desc BUR09</description>
                    <addressOffset>0x708</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR10</name>
                    <description>desc BUR10</description>
                    <addressOffset>0x709</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR11</name>
                    <description>desc BUR11</description>
                    <addressOffset>0x70A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR12</name>
                    <description>desc BUR12</description>
                    <addressOffset>0x70B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR13</name>
                    <description>desc BUR13</description>
                    <addressOffset>0x70C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR14</name>
                    <description>desc BUR14</description>
                    <addressOffset>0x70D</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR15</name>
                    <description>desc BUR15</description>
                    <addressOffset>0x70E</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
                <register>
                    <name>BUR16</name>
                    <description>desc BUR16</description>
                    <addressOffset>0x70F</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
